Ran Plan for dir: `vpc` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=ap-southeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be created
+ resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Main-IGW"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
        }
      + tags_all = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Main-IGW"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Route-Table"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
        }
      + tags_all         = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Route-Table"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-0"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-0"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-1"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-1"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-2"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-2"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-0"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "public"
        }
      + tags_all                                       = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-0"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-1"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "public"
        }
      + tags_all                                       = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-1"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-2"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "public"
        }
      + tags_all                                       = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-2"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
          + "type"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.elasticsearch_vpc will be created
+ resource "aws_vpc" "elasticsearch_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Elasticsearch-VPC"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
        }
      + tags_all                             = {
          + "Environment" = "playground"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Elasticsearch-VPC"
          + "Owner"       = "team-cloud-infra"
          + "TFProject"   = "github.com/tampubolon/elasticsearch-lab/vpc"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ igw_id              = (known after apply)
+ private_subnet_0_id = (known after apply)
+ private_subnet_1_id = (known after apply)
+ private_subnet_2_id = (known after apply)
+ public_subnet_0_id  = (known after apply)
+ public_subnet_1_id  = (known after apply)
+ public_subnet_2_id  = (known after apply)
+ vpc_cidr            = "192.168.0.0/16"
+ vpc_id              = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d vpc`
* :put_litter_in_its_place: To **delete** this plan click [here](http://a3235ad69b8a:4141/lock?id=tampubolon%252Felasticsearch-lab%252Fvpc%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d vpc`
</details>
Plan: 12 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`